5. Handling Missing Values

In [3]:
import pandas as pd

venky = {
    "A" :[1,2,None,4,5] , 
    "B" :[None,2,3,4,5] , 
    "C" : [1,None,3,4,None]
    }
table  = pd.DataFrame(yash)
print(table)

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  NaN

In [5]:
table.isnull()

       A      B      C
0  False   True  False
1  False  False   True
2   True  False  False
3  False  False  False
4  False  False   True

In [20]:
table.isnull().sum()

A    1
B    1
C    2
dtype: int64

In [22]:
table.dropna()

     A    B    C
3  4.0  4.0  4.0

In [23]:
table.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [7]:
table.fillna("venky")

       A      B      C
0    1.0  venky    1.0
1    2.0    2.0  venky
2  venky    3.0    3.0
3    4.0    4.0    4.0
4    5.0    5.0  venky

In [21]:
table.ffill()

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  1.0
2  2.0  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  4.0

In [23]:
table.bfill()

     A    B    C
0  1.0  2.0  1.0
1  2.0  2.0  3.0
2  4.0  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  NaN

In [13]:
print(table["A"].mean())
print(table["B"].mean())
print(table["C"].mean())

3.0
3.5
2.6666666666666665

In [38]:
table.fillna(table.mean().round(2))

     A    B     C
0  1.0  3.5  1.00
1  2.0  2.0  2.67
2  3.0  3.0  3.00
3  4.0  4.0  4.00
4  5.0  5.0  2.67

SCIKIT LEARN

In [17]:
import numpy as np 
from sklearn.impute import SimpleImputer

data = {
    "Color": [1,2,5, None,6],
    "Size": [None, "Medium", "Small", "Large", None],
    "Shape": ["Circle", "Square", "Circle", None, "Triangle"]
}

cat = pd.DataFrame(data)
print(cat)

   Color    Size     Shape
0    1.0    None    Circle
1    2.0  Medium    Square
2    5.0   Small    Circle
3    NaN   Large      None
4    6.0    None  Triangle

In [25]:


file_path = 'missing values.xlsx'


excel = pd.read_excel(file_path)

display(excel)

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes
5   India  40.0  69600.0            Yes
6  Brazil   NaN  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

In [64]:
import pandas as pd
from sklearn.impute import SimpleImputer



print("Original DataFrame:")
print(excel)

# Identify numerical and categorical 
num_col = excel.select_dtypes(include=['number']).columns
cat_col = excel.select_dtypes(exclude=['number']).columns

# Create imputer objects
imputer_numeric = SimpleImputer(strategy='mean')
imputer_category = SimpleImputer(strategy='most_frequent')

# Apply imputation for numerical columns
excel[num_col] = imputer_numeric.fit_transform(excel[num_col])

# Apply imputation for categorical columns
excel[cat_col] = imputer_category.fit_transform(excel[cat_col])

print("\nDataFrame after imputation:")
print(excel)

Original DataFrame:
   Region        Age        Income Online Shopper
0   India  49.000000  86400.000000             No
1  Brazil  32.000000  57600.000000            Yes
2     USA  35.000000  64800.000000             No
3  Brazil  43.000000  73200.000000             No
4     USA  45.000000  76533.333333            Yes
5   India  40.000000  69600.000000            Yes
6  Brazil  43.777778  62400.000000             No
7   India  53.000000  94800.000000            Yes
8     USA  55.000000  99600.000000             No
9   India  42.000000  80400.000000            Yes

DataFrame after imputation:
   Region        Age        Income Online Shopper
0   India  49.000000  86400.000000             No
1  Brazil  32.000000  57600.000000            Yes
2     USA  35.000000  64800.000000             No
3  Brazil  43.000000  73200.000000             No
4     USA  45.000000  76533.333333            Yes
5   India  40.000000  69600.000000            Yes
6  Brazil  43.777778  62400.000000             No
7   India  53.000000  94800.000000            Yes
8     USA  55.000000  99600.000000             No
9   India  42.000000  80400.000000            Yes

In [68]:


# Identify numerical and categorical 
num_col = excel.select_dtypes(include=['number']).columns
cat_col = excel.select_dtypes(exclude=['number']).columns

# Create imputer objects
imputer_numeric = SimpleImputer(strategy='mean')
imputer_category = SimpleImputer(strategy='most_frequent')

# Apply imputation for numerical columns
excel[num_col] = imputer_numeric.fit_transform(excel[num_col])

# Apply imputation for categorical columns
excel[cat_col] = imputer_category.fit_transform(excel[cat_col])

excel[num_col] = excel[num_col].round(2)

print("\nDataFrame after imputation:")
print(excel)

DataFrame after imputation:
   Region    Age    Income Online Shopper
0   India  49.00  86400.00             No
1  Brazil  32.00  57600.00            Yes
2     USA  35.00  64800.00             No
3  Brazil  43.00  73200.00             No
4     USA  45.00  76533.33            Yes
5   India  40.00  69600.00            Yes
6  Brazil  43.78  62400.00             No
7   India  53.00  94800.00            Yes
8     USA  55.00  99600.00             No
9   India  42.00  80400.00            Yes

In [87]:
file_path = 'titanic.csv'


df = pd.read_csv(file_path)
display(df)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [88]:
# Handle missing values
# For numeric columns
numeric_cols = ['Age', 'Fare']
imputer_numeric = SimpleImputer(strategy='median')  # Using median for robustness
df[numeric_cols] = imputer_numeric.fit_transform(df[numeric_cols])

# For categorical columns
categorical_cols = ['Embarked']
imputer_categorical = SimpleImputer(strategy='most_frequent')
df[categorical_cols] = imputer_categorical.fit_transform(df[categorical_cols])

# Drop the 'Cabin' column due to excessive missing values

In [86]:
display(df)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q